{
  "meta": {
    "title": "World of Lorecraft: Ashes of the Everpath",
    "subtitle": "The World That Notices",
    "author": "Sound Logic Studios",
    "version": "1.1.0",
    "checkpoint": "S01–S30",
    "buildTimestamp": "2026-01-17T00:00:00Z"
  },
  "packId": "world_of_lorecraft",
  "assets": {
    "cover": "content/packs/starter/covers/world-of-lorecraft.png",
    "background": "styles/screens/ui/backgrounds/story-panel/lorecraft-story-panel-narrative.webp",
    "music": "content/packs/starter/audio/lore_theme.mp3"
  },
  "blurb": "There will be other adventures to come. This is the first of many—take your time and choose carefully. No one read is ever the same. You are now part of the VerseCraft universe!",
  "start": "S01",
  "scenes": {
    "S01": {
      "text": "You stand before the Great Archive of Lorecraft. Lanterns hover like tame stars, and the floor beneath you is a mosaic of old maps. The doors are not locked—they are deciding.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nAt the end of the page, you weigh your options:\n– Step into the Archive and let the doors seal behind you.\n– Study the lantern patterns for warning signs and hidden routes.\n– Step back to the plaza and watch who enters and who leaves.",
      "options": [
        {
          "label": "Enter",
          "to": "S02"
        },
        {
          "label": "Observe",
          "to": "S03"
        },
        {
          "label": "Delay",
          "to": "S04"
        }
      ]
    },
    "S02": {
      "text": "The doors close with a soft finality. Shelves stretch like cathedral pillars, and every spine hums with the pressure of untold names.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nAt the end of the page, you weigh your options:\n– Follow the loudest humming book deeper into the stacks.\n– Search for a directory map near the entrance hall.\n– Call for a librarian and wait—without flinching.",
      "options": [
        {
          "label": "Follow",
          "to": "S05"
        },
        {
          "label": "Map",
          "to": "S06"
        },
        {
          "label": "Call",
          "to": "S07"
        }
      ]
    },
    "S03": {
      "text": "Lanterns drift overhead in a slow spiral, tracing invisible routes. One lantern blinks twice—too deliberate to be random.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nAt the end of the page, you weigh your options:\n– Touch the blinking lantern and accept what it shows.\n– Ignore it and walk straight down the central aisle.\n– Stand still and listen for words inside the light.",
      "options": [
        {
          "label": "Touch",
          "to": "S06"
        },
        {
          "label": "Ignore",
          "to": "S05"
        },
        {
          "label": "Listen",
          "to": "S07"
        }
      ]
    },
    "S04": {
      "text": "You step back into the plaza. The archive’s doors seem to watch you. You can still commit—or choose caution and gather information first.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nAt the end of the page, you weigh your options:\n– Return and enter the Archive anyway.\n– Wait and observe patterns in who comes and goes.\n– Scout the building exterior for service routes.",
      "options": [
        {
          "label": "Enter",
          "to": "S02"
        },
        {
          "label": "Wait",
          "to": "S07"
        },
        {
          "label": "Scout",
          "to": "S09"
        }
      ]
    },
    "S05": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 5). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S06"
        },
        {
          "label": "Inspect",
          "to": "S07"
        },
        {
          "label": "Steady",
          "to": "S06"
        }
      ]
    },
    "S06": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 6). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S07"
        },
        {
          "label": "Inspect",
          "to": "S08"
        },
        {
          "label": "Steady",
          "to": "S07"
        }
      ]
    },
    "S07": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 7). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S08"
        },
        {
          "label": "Inspect",
          "to": "S09"
        },
        {
          "label": "Steady",
          "to": "S08"
        }
      ]
    },
    "S08": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 8). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S09"
        },
        {
          "label": "Inspect",
          "to": "S10"
        },
        {
          "label": "Steady",
          "to": "S09"
        }
      ]
    },
    "S09": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 9). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S10"
        },
        {
          "label": "Inspect",
          "to": "S11"
        },
        {
          "label": "Steady",
          "to": "S10"
        }
      ]
    },
    "S10": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 10). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S11"
        },
        {
          "label": "Inspect",
          "to": "S12"
        },
        {
          "label": "Steady",
          "to": "S11"
        }
      ]
    },
    "S11": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 11). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S12"
        },
        {
          "label": "Inspect",
          "to": "S13"
        },
        {
          "label": "Steady",
          "to": "S12"
        }
      ]
    },
    "S12": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 12). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S13"
        },
        {
          "label": "Inspect",
          "to": "S14"
        },
        {
          "label": "Steady",
          "to": "S13"
        }
      ]
    },
    "S13": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 13). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S14"
        },
        {
          "label": "Inspect",
          "to": "S15"
        },
        {
          "label": "Steady",
          "to": "S14"
        }
      ]
    },
    "S14": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 14). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S15"
        },
        {
          "label": "Inspect",
          "to": "S16"
        },
        {
          "label": "Steady",
          "to": "S15"
        }
      ]
    },
    "S15": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 15). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S16"
        },
        {
          "label": "Inspect",
          "to": "S17"
        },
        {
          "label": "Steady",
          "to": "S16"
        }
      ]
    },
    "S16": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 16). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S17"
        },
        {
          "label": "Inspect",
          "to": "S18"
        },
        {
          "label": "Steady",
          "to": "S17"
        }
      ]
    },
    "S17": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 17). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S18"
        },
        {
          "label": "Inspect",
          "to": "S19"
        },
        {
          "label": "Steady",
          "to": "S18"
        }
      ]
    },
    "S18": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 18). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S19"
        },
        {
          "label": "Inspect",
          "to": "S20"
        },
        {
          "label": "Steady",
          "to": "S19"
        }
      ]
    },
    "S19": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 19). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S20"
        },
        {
          "label": "Inspect",
          "to": "S21"
        },
        {
          "label": "Steady",
          "to": "S20"
        }
      ]
    },
    "S20": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 20). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S21"
        },
        {
          "label": "Inspect",
          "to": "S22"
        },
        {
          "label": "Steady",
          "to": "S21"
        }
      ]
    },
    "S21": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 21). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S22"
        },
        {
          "label": "Inspect",
          "to": "S23"
        },
        {
          "label": "Steady",
          "to": "S22"
        }
      ]
    },
    "S22": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 22). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S23"
        },
        {
          "label": "Inspect",
          "to": "S24"
        },
        {
          "label": "Steady",
          "to": "S23"
        }
      ]
    },
    "S23": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 23). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S24"
        },
        {
          "label": "Inspect",
          "to": "S25"
        },
        {
          "label": "Steady",
          "to": "S24"
        }
      ]
    },
    "S24": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 24). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S25"
        },
        {
          "label": "Inspect",
          "to": "S26"
        },
        {
          "label": "Steady",
          "to": "S25"
        }
      ]
    },
    "S25": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 25). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S26"
        },
        {
          "label": "Inspect",
          "to": "S27"
        },
        {
          "label": "Steady",
          "to": "S26"
        }
      ]
    },
    "S26": {
      "text": "You push deeper into Lorecraft’s inner halls (Step 26). Doors appear where none existed, and the floor plan subtly changes under your feet.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nAt the end of the page, you weigh your options:\n– Continue deeper, refusing distraction.\n– Inspect the nearest symbol etched into the wall for meaning.\n– Pause, breathe, and steady your focus before moving.",
      "options": [
        {
          "label": "Continue",
          "to": "S27"
        },
        {
          "label": "Inspect",
          "to": "S27"
        },
        {
          "label": "Steady",
          "to": "S27"
        }
      ]
    },
    "S27": {
      "text": "At the final door, three seals glow: Gold, Ash, and Violet. Each promises a different ending to the same truth.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nIf you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nAt the end of the page, you weigh your options:\n– Touch the Gold seal—clarity and honor.\n– Touch the Ash seal—cost and consequence.\n– Touch the Violet seal—mystery and transformation.",
      "options": [
        {
          "label": "Gold",
          "to": "S28"
        },
        {
          "label": "Ash",
          "to": "S29"
        },
        {
          "label": "Violet",
          "to": "S30"
        }
      ]
    },
    "S28": {
      "text": "GOOD ENDING: The Gold seal yields. Lorecraft’s core reveals itself as a living index, and you are recorded not as a thief, but as a chosen curator. You leave with knowledge—and the right to return.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nSomewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nAt the end of the page, you weigh your options:\n– Return to the beginning and try another path.",
      "options": [
        {
          "label": "Restart",
          "to": "S01"
        }
      ]
    },
    "S29": {
      "text": "BAD ENDING: The Ash seal cracks. Smoke fills your lungs with forgotten names. You stumble out carrying a lesson you can’t quite remember, only the weight of regret and a vow not to repeat it.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. Light gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand.\n\nThe air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nEvery choice you make seems to leave a faint afterimage, as if the world is keeping notes. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning. You slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nAt the end of the page, you weigh your options:\n– Return to the beginning and try another path.",
      "options": [
        {
          "label": "Restart",
          "to": "S01"
        }
      ]
    },
    "S30": {
      "text": "SPECIAL ENDING: The Violet seal dissolves. You step through and feel your story thread into the Archive itself—part reader, part page. When you return, you’re not the same, and neither is the world.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. If you listen closely, you can hear the place noticing you back—evaluating, remembering, inviting, warning.\n\nLight gathers in seams and corners, catching on dust and carved edges, turning ordinary surfaces into a map only patience can understand. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nYou slow your breathing on purpose. Not because you feel safe, but because you refuse to let fear write the next sentence for you. Every choice you make seems to leave a faint afterimage, as if the world is keeping notes. The air tastes like old paper and distant rain, the kind that never quite reaches the ground but changes everything anyway. Somewhere in the structure around you, mechanisms of story click into place—quiet, deliberate—like a library deciding what it will allow you to read.\n\nAt the end of the page, you weigh your options:\n– Return to the beginning and try another path.",
      "options": [
        {
          "label": "Restart",
          "to": "S01"
        }
      ]
    }
  }
}
